Revit 2027 API
BuiltInFailures.StairRampFailures.BadRailings Property
 Can't create Railings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadRailings { get; }
Public Shared ReadOnly Property BadRailings As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadRailings {
	FailureDefinitionId^ get ();
}
static member BadRailings : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace